<template>
  <div>
    <div class="banner-wrapper">
      <v-container>
        <!-- -----------------------------------------------
              Start Banner
          ----------------------------------------------- -->
        <v-row justify="center">
          <v-col cols="12" md="7" lg="6" class="d-flex align-center">
            <div class="text-center text-md-left">
              <main>
                <img :src="result[grade].img" :alt="result[grade].title">
                <div class="contain" style="margin-bottom: 50px;">
                  <h1>{{result[grade].title}}</h1>
                  <!-- v-html 은 보안상의 문제, XSS 와 같은 문제가 있을 수 있다.
                    그러므로 반드시 사용자가 컨트롤하거나 악용할 수 있는 문제에는 사용해선 안 된다.
                    오직 개발자가 의도한 값만 표출해줄 때 사용해주면 된다. -->
                  <p v-html="result[grade].description"></p>
                </div>
                <TestButton text="다시 테스트하기!" :clickEvent="resetPage"/>
              </main>
            </div>
          </v-col>
        </v-row>
      </v-container>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      grade: null,
      result: {
        A: {
          img: "/img/dog/gradeA.png",
          title: "와우 A등급 입니다.",
          description: `<b>"좋은 견주가 될 준비가 된 거 같아요"</b>
          <br/>
<!--          <br /> - 엄근진의 대명사. -->
<!--          <br /> - 모든 학생을 공정하게 대우하며 뛰어난 실력으로 20대의 나이에 교수 자리에 오른 모범적 인물이에요. -->
<!--          <br /> - 주어진 업무나 책임을 끝까지 완수하고 충성심이 높아 덤블도어가 가장 신임한답니다. -->
<!--          <br /> - 논리적이고 합리적인 것을 중시하며 현실적이에요.-->
<!--          <br /> - 겉만 보면 냉랭한 마녀랍니다.-->
<!--          <br /> - 갑작스러운 변화를 싫어해서 해리포터 3인방을 매우 골칫 덩어리로 생각해요. -->
<!--          <br />  - 하지만 자기 사람이기에 든든한 지원군이 되어 그들이 원하는 일을 할 수 있도록 지원을 아끼지 않죠.-->
<!--          <br /> - 본인만의 위트가 있어요. 완전 무뚝뚝쟁이는 아니랍니다.-->
<!--          -->
<!--          <br/><br/>-->
<!--          <br /> - 하지만 가끔식 지나치게 상대를 통제하려는 경향이 있어요.-->
<!--          <br /> - 보통 이런 경향은 스스로가 대단하다는 걸 아는 자의식 과잉의 결과물입니다. -->
<!--          <br /> - 스스로 잘났단 걸 아는 경우가 대부분인데요 실제로 그렇게 잘나기도 해서 가끔 재수없어요.-->
<!--          <br /> - 다른 교수들과 함께 일하지 않고 혼자서 일하려는 경우가 많습니다.-->
<!--          <br /> - 농담을 하지만 진지하게 농담을 하는 편이라서 본인만 즐겁고 남들은 웃지 못해요.-->
<!--          <br /> - 융통성이 없어서 답답하다는 소리를 들을 때가 종종 있어요.-->
`
        },


        B: {
          img: "/img/dog/gradeB.png",
          title: "B 등급입니다. 괜찮네요",
          description: `<b>"조금 더 노력하면 좋은 견주가 될 거 같아요"</b>
          <br/>
<!--          <br /> - 초기에는 어리버리했으나 마지막에 가서 포텐 터진 캐릭터. -->
<!--          <br /> - 어렸을 때는 슬리데린 학생들로부터 괴롭힘을 당했지만 나중에는 슬리데린 애들을 혼쭐 냅니다.-->
<!--          <br /> - 조용하고 차분해요. 디테일 하나하나 신경쓰는 세심한 성격이죠. -->
<!--          <br /> - 기억력도 좋아 약초학에서만큼은 헤르미온느를 능가해요.-->
<!--          <br /> - 공감 능력이 뛰어나고, 상대방의 이야기를 잘 들어주는 전형적인 착한 친구랍니다.-->
<!--          <br /> - 겉으론 유약해 보여도 안은 매우 단단해서 외유내강의 표본입니다.-->
<!--          <br /> - 의리가 있고 용기도 있어서 가끔씩 내 편 들어줄 때 보면 내가 알던 네빌 맞나 싶어요.-->
<!--          <br /> - 볼드모트를 앞에 두고도 당당하고 호크룩스를 깨는 등, 평소에는 조용하지만 해야할 때 가장 용기 있게 나서는 인물입니다. -->
<!--          -->
<!--          <br/><br/> -->
<!--          <br /> - 하지만 개인주의적 성향이 있어 개인 시간을 방해 받는 것을 매우 싫어해요.-->
<!--          <br /> - 집에서 쉬는 것을 좋아하고, 개인적인 시간 갖는 것을 중요하게 생각하죠.-->
<!--          <br /> - 즉흥적으로 하는 것을 싫어하고, 무계획으로 사는 론을 보면서 답답해 하기도 합니다. -->
<!--          <br /> - 완벽주의적인 성향이 있어서 일을 하다 완벽하지 못할 것 같으면 대충 해버리거나 아예 시작을 안 해요.-->
<!--          <br /> - 남들에게 싫은 소리를 잘 하지 못해요. 혼자 상처 받고 혼자서 곱씹다가 틀어지는 경우가 종종 있어요-->
<!--          <br /> - 더 큰 문제는 그렇게 혼자서 막장 드라마 찍고 상대를 완전히 배척하는 경향이 있어요.-->
`
        },


        C: {
          img: "/img/dog/gradeC.png",
          title: "C 등급이에요..노력이 필요해 보여요..",
          description: `<b>"많은 노력이 필요해 보입니다. 반려견을 키우는걸 조금 더 고민해 보는 건 어떨까요?"</b>
          <br/>
<!--          <br /> - 호그와트의 챔피언이자 인기 스타.-->
<!--          <br /> - 책임감이 있고, 정직하며 한결 같아 많은 사람으로부터 인정을 받습니다.-->
<!--          <br /> - 경쟁자 해리에게 구해줘서 고맙다며 챔피언 자리를 내줄 만큼 상황을 잘 받아들이고 의리가 있죠.-->
<!--          <br /> - 리더의 자질을 타고 났고 옳고 그름을 잘 구별합니다.-->
<!--          <br /> - 준비성이 철저하고 참을성이 많으며 타인을 잘 돕죠. 그래서 인기가 많아요.-->
<!--          <br /> - 덤블도어는 그를 "언제나 모범적이고 신의있고 성실한 학생" 이라고 말합니다.-->
<!--          <br /> - 상대를 향한 배려심이 있고 조화와 균형을 중요시하죠.-->


<!--          <br/><br/>-->
<!--          <br /> - 그러나 남 싫은 소리를 잘 못해요. 동의하진 않지만 겉으론 "맞아, 맞아"라며 동의해주죠.-->
<!--          <br /> - 더 나은 목표를 위해 비판을 수용하지만 필요 이상으로 비판을 곱씹을 때가 있어요-->
<!--          <br /> - 생각이 많아서 걱정이나 불안감에 종종 휩싸입니다.-->
<!--          <br /> - 늘 타인과의 관계에서 고민이 많아요-->
<!--          <br /> - 친구들이 있을 때 빛나지만 혼자 있을 때는 더욱 고독합니다.-->
<!--          <br /> - 오해 받는 것을 매우 매우 싫어해요.-->
<!--          <br /> - 남들을 잘 챙겨주는 것은 맞지만 자신의 이득도 뒤에서 잘 챙기는 스타일입니다.-->
`
        },
        F: {
          img: "/img/dog/gradeF.png",
          title: "F등급 입니다. 자격 미달이에요",
          description: `<b>"저는 자격 미달이라고 생각해요. 아주 많은 노력과 공부 가 필요해 보여요."</b>
          <br/>
<!--          <br /> - 호그와트의 챔피언이자 인기 스타.-->
<!--          <br /> - 책임감이 있고, 정직하며 한결 같아 많은 사람으로부터 인정을 받습니다.-->
<!--          <br /> - 경쟁자 해리에게 구해줘서 고맙다며 챔피언 자리를 내줄 만큼 상황을 잘 받아들이고 의리가 있죠.-->
<!--          <br /> - 리더의 자질을 타고 났고 옳고 그름을 잘 구별합니다.-->
<!--          <br /> - 준비성이 철저하고 참을성이 많으며 타인을 잘 돕죠. 그래서 인기가 많아요.-->
<!--          <br /> - 덤블도어는 그를 "언제나 모범적이고 신의있고 성실한 학생" 이라고 말합니다.-->
<!--          <br /> - 상대를 향한 배려심이 있고 조화와 균형을 중요시하죠.-->


<!--          <br/><br/>-->
<!--          <br /> - 그러나 남 싫은 소리를 잘 못해요. 동의하진 않지만 겉으론 "맞아, 맞아"라며 동의해주죠.-->
<!--          <br /> - 더 나은 목표를 위해 비판을 수용하지만 필요 이상으로 비판을 곱씹을 때가 있어요-->
<!--          <br /> - 생각이 많아서 걱정이나 불안감에 종종 휩싸입니다.-->
<!--          <br /> - 늘 타인과의 관계에서 고민이 많아요-->
<!--          <br /> - 친구들이 있을 때 빛나지만 혼자 있을 때는 더욱 고독합니다.-->
<!--          <br /> - 오해 받는 것을 매우 매우 싫어해요.-->
<!--          <br /> - 남들을 잘 챙겨주는 것은 맞지만 자신의 이득도 뒤에서 잘 챙기는 스타일입니다.-->
`
        }
      }
    }
  },
  created() {
    this.grade = this.$route.params.grade;
    console.log(this.grade);
    console.log(this.$router);
    if (this.result[this.$route.params.grade] === undefined) {
      this.$router.push({name: "index"})
    }
  },
  methods: {
    resetPage() {
      this.$store.dispatch('clickResetButton')
      this.$router.push({name: "index"})
    }
  }
}
</script>

<style>
  img{
    width: 50%;
    height: auto;
  }
  h1 {
    font-size: 2em;
    /*text-shadow: 0 0 50px rgb(40, 40, 187), 0 0 3px #fff;*/
  }

  p {
    font-size: 18px;
    /*color: #fff;*/
    line-height: 1.5;
  }
  
  main .contain p > b {
    font-size: 25px;
  }
</style>